{"data":{"repository":{"discussions":{"totalCount":3,"nodes":[{"id":"D_kwDOI2aXnM4ASjgD","category":{"name":"Meetings"},"upvoteCount":1,"updatedAt":"2023-02-22T18:02:02Z","createdAt":"2023-02-16T03:21:25Z","number":6,"title":"Proposed Transactions meeting agenda for 2023-02-22","body":"## Meeting Details\r\n\r\n- **Date/Time:** February 22th, 2023 @ Wednesday 1:00 PM ET / 18:00 UTC / 7:00 PM CET\r\n- **Location:** Link should be posted in the `#Transactions` text and voice channel on Discord at least 5 days before the meeting.\r\n- **Moderator:** TBA\r\n- **Note Taker** Person\r\n\r\nThe [FIG Transactions Meetings](https://github.com/Open-MV/fig-transactions/tree/main/meetings) repo contains the history past meetings, including a link to the agenda, recording, notes, and resources.\r\n\r\n## Meeting Agenda\r\nBreaking down and prioritizing database entries\r\nDiscussing which items to add to security and privacy agenda\r\nUpdate on charter items added as database elements.\r\n\r\n\r\n**Discuss agenda from proposed topics**\r\n\r\n## Outcomes from Discussion topics\r\n\r\n## Action Items\r\n\r\n## Items for next week's meeting\r\n**List items that need to be discussed next week**\r\n\r\n## Open Discussion Items\r\n\r\nList any additional items below!\r\n","author":{"login":"OBWANDO"},"comments":{"nodes":[{"id":"DC_kwDOI2aXnM4ATYLB","author":{"login":"will-a123"},"body":"I'm not available for a call today, but have made myself a ticket to research the current top 5 micropayments specialists and put together a brief summary of each -- assuming that we still feel that the OMF's eventual uber-protocol should have some build in support for the concept of micropayments, regardless of whether or not it gets used (sort of like HTTP 402)"}]},"labels":{"nodes":[]}},{"id":"D_kwDOI2aXnM4ASfIp","category":{"name":"Meetings"},"upvoteCount":1,"updatedAt":"2023-02-16T03:24:54Z","createdAt":"2023-02-10T19:11:33Z","number":3,"title":"Transactions meeting agenda for 2023-02-15","body":"## Meeting Details\r\n\r\n- **Date/Time:** February 15th, 2023 @ Wednesday 1:00 PM ET / 18:00 UTC / 7:00 PM CET\r\n- **Location:** Link should be posted in the `#Transactions` text and voice channel on Discord at least 5 days before the meeting.\r\n- **Moderator:** @OBWANDO \r\n- **Note Taker** @OBWANDO \r\n\r\nThe [FIG Transactions Meetings](https://github.com/Open-MV/fig-transactions/tree/main/meetings) repo contains the history past meetings, including a link to the agenda, recording, notes, and resources.\r\n\r\n## Meeting Agenda\r\nCharter discussion\r\nReview linking defined terms to glossary to ensure we're saying the same thing.\r\nTriage the priority of database entries\r\n\r\n## Outcomes from Discussion topics\r\n\r\nJargon needs to be clearly defined with glossy and linkage.\r\nPossible to use chatGPT or auto link definitions.\r\nClearly define the split of how centralized or decentralized can be used to ensure settlement and processing is done\r\nUnderstand when to work with Security and privacy on items like zero-knowledge proofs.\r\n\r\n## Action Items\r\nNeed to refine some of the broader database items (4-6) in table.\r\n\r\n## Items for next week's meeting\r\nDiscuss the different payment gateway systems, and commonality of elements\r\n\r\n## Open Discussion Items\r\n\r\nList any additional items below!\r\n","author":{"login":"OBWANDO"},"comments":{"nodes":[]},"labels":{"nodes":[]}},{"id":"D_kwDOI2aXnM4ASar9","category":{"name":"Meetings"},"upvoteCount":1,"updatedAt":"2023-02-12T19:50:13Z","createdAt":"2023-02-06T14:03:27Z","number":2,"title":"Transactions meeting agenda for 2023-02-08","body":"## Meeting Details\r\n\r\n- **Date/Time:** February 8th, 2023 @ Wednesday 1:00 PM ET / 18:00 UTC / 7:00 PM CET\r\n- **Location:** Link should be posted in the `#Transactions` text and voice channel on Discord at least 5 days before the meeting.\r\n- **Moderator:** TBA\r\n- **Note Taker** Person\r\n\r\nThe [FIG Transactions Meetings](https://github.com/Open-MV/fig-transactions/tree/main/meetings) repo contains the history past meetings, including a link to the agenda, recording, notes, and resources.\r\n\r\n## Meeting Agenda\r\nFirst meeting and operating\r\nFIG charter discussion\r\nDatabase Feature triage\r\n\r\n**Discuss agenda from proposed topics**\r\n\r\n## Outcomes from Discussion topics\r\n\r\nwhat should we be doing and what should we not be doing\r\nNeed to have people contribute to charter for OMF - how does it drive function reqs\r\n\r\nHow to define rights and obligations someone should have \r\nAn example was where platform operator has no obligation to support asset ingress/egress, and platform users has no rights to transact or influcence other\r\n\r\nDive deeper into operator obligation - prioritizing platform operator - rights of platform users - obligations of payment service - \r\n\r\nWhat are bare minimums and obligations of platform operator - \r\nNeed to provide definition of these obligations\r\nNeed clear definition of platform operator and put it in the glossary\r\nNeed to understand clear platform obligation of payment and users\r\nNeed to clearly define transaction in glossary\r\n\r\nNeed to better define what we are as a FIG that we facilitate transactions, but that we arent the actual trsnaction itself (payment/clearing)\r\nDraw the line from the API and the endpoint provider - \r\n\r\nNeed to support the testing of the API for approved plugins -\r\nhow do we have right people providing requirements early on - \r\n\r\n---\r\n\r\nbill_a123 - transactions ecommerce - \r\nsettlement transactions - should everything be recorded on a ledger\r\nis it the backbone of metaverse protcol - follow ledger of history -\r\n\r\nhow do we address the ledger as a global or a smaller series of sectional ledgers and others\r\nneed a way to query for object identity - \r\n\r\nverify for server - \r\n\r\n## Action Items\r\n\r\nHave community start fleshing out the charter\r\nNeed to provide and start linking defined terms to ensure we're saying the same thing.\r\n\r\n## Items for next week's meeting\r\n**List items that need to be discussed next week**\r\n\r\n## Open Discussion Items\r\n\r\nList any additional items below!\r\n","author":{"login":"OBWANDO"},"comments":{"nodes":[{"id":"DC_kwDOI2aXnM4ASsCF","author":{"login":"clasoncj"},"body":"Proposed Topic: Requirements gathering from users of this component\r\n\r\n* How can we ensure the end users of this component (such as platform operators) are driving requirements?\r\n* Can/should we try to close out fundamental implementation details early before diving into specific feature implementation? \r\n\r\nExample: For transactions involving digital assets, is there consensus from platform operators on the following:\r\n\r\na) Run the ledger that acts as a system of record for digital asset ownership or use a 3rd party\r\nb) Have the ability to directly control the transfer of assets from one user to another\r\nc) Have the ability to prevent the transfer of assets from one user to another\r\nd) Desire to stay completely out of the transfer of digital assets between users but facilitate two users doing a peer to peer transaction\r\n\r\n\r\n"},{"id":"DC_kwDOI2aXnM4ASsjG","author":{"login":"will-a123"},"body":"In a similar vein to @clasoncj 's I'm focused on the most abstract interpretation of what a \"transaction\" should mean:\r\n\r\n- At an abstract level, what are the kinds of transactional activities we expect metaverse users to do? Do they look like e-commerce? m-commerce? Traditional commerce? Behavioral recordkeeping? Something else?\r\n- Are there any potentially metaverse-unique activities that we may want to optimize for, like micropayments for access to content or movement between metaverse real-estate?\r\n- Should the fundamental backbone of \"the OMF metaverse\" actually be the transaction system, with all worlds, entities and objects kept on an OMF ledger?\r\n\r\nI think it will also be helpful to put together a list of required transaction types, which was discussed a bit in discord based on this table:\r\n\r\n![image](https://user-images.githubusercontent.com/22437489/217439456-ceaf6a70-ae84-4316-a478-b43c01e838e4.png)\r\n"}]},"labels":{"nodes":[]}}]}}}}