{"data":{"repository":{"discussions":{"totalCount":7,"nodes":[{"id":"D_kwDOI2aYAs4ATld1","category":{"name":"Meetings"},"upvoteCount":1,"updatedAt":"2023-04-26T16:58:01Z","createdAt":"2023-04-26T16:57:54Z","number":11,"title":"Virtual Worlds and Simulations meeting agenda for 2023-04-26","body":"Meeting notes:\r\n\r\nPR:\r\n- maybe establish a presence in an existing metaverse network?\r\n- indiebio interested in world building for PR presence (refer to yesterday's community meeting)\r\n- making a document for 'how to contribute' for different types of contributors\r\n- listing out workgroup projects on the website for PR\r\n- generating excitement! (at all levels, developers and end users)\r\n- kickstart projects: for what people are interested in so they know what they'd be joining for, and for limiting to a clear scope\r\n\r\nfunding:\r\n- introducing a code bounty program\r\n- project kickstart funding, figuring out specific projects (workgroups)\r\n- meeting members lack knowledge/experience on what we can do with this\r\n\r\norganizational:\r\n- we need an organizational roadmap, who's making what decisions and when?\r\n- specific deliverable of a period\r\n- get help from other orgs to get things kickstarter on an organizational perspective\r\n- learning from hackathons\r\n\r\ncollaboration with other projects:\r\n- when approaching other projects, we need actionable points to talk about\r\n- specific ongoing work on a project we may be able to help with\r\n- field analysis of how projects solve or do not solve problems\r\n\r\nQuestion: What makes a good workgroup project for the purpose of kickstart funding?\r\n- maybe a reference: <https://cesium.com/cesium-ecosystem-grants>\r\n\r\npotential projects:\r\n- integrating daicon with bevy\r\n- framework for real-world data visualized and queried in the metaverse / real-world data viewer\r\n","author":{"login":"LaylBongers"},"comments":{"nodes":[]},"labels":{"nodes":[]}},{"id":"D_kwDOI2aYAs4ATVFU","category":{"name":"Meetings"},"upvoteCount":1,"updatedAt":"2023-04-10T14:52:45Z","createdAt":"2023-04-10T14:52:44Z","number":10,"title":"Virtual Worlds and Simulations meeting agenda for 2023-04-12","body":"## Meeting Details\r\n- Date/Time: February 12th, 2023 @ Wednesday 12:00 PM ET / 17:00 UTC / 6:00 PM CET\r\n- Location: Link should be posted in the #Virtual-world-sim text and voice channel on Discord at least 5 days before the meeting.\r\n- Moderator: @LaylBongers\r\n- Note Taker @LaylBongers\r\n\r\n## Meeting Agenda\r\n- Catch-up over the last period, 'state of the fig'\r\n- Roadmap plan\r\n- Organizational task triage\r\n- Database feature triage\r\n\r\n## Outcomes from Discussion topics\r\n\r\n## Action Items\r\n\r\n## Items for next week's meeting\r\n\r\n## Open Discussion Items\r\n","author":{"login":"LaylBongers"},"comments":{"nodes":[]},"labels":{"nodes":[]}},{"id":"D_kwDOI2aYAs4ATOwI","category":{"name":"Ideas"},"upvoteCount":1,"updatedAt":"2023-04-03T21:12:08Z","createdAt":"2023-04-03T20:23:43Z","number":9,"title":"My draft of an RFC","body":"# The metaverse Service Convention\r\n\r\n### Summary:\r\nThe metaverse is a vision of a fully immersive, interconnected virtual world that enables users to seamlessly move between different virtual environments and experiences. To make this vision a reality, we need a standards-based metaverse protocol that defines and enforces technical standards for the network. This protocol would be governed by a Standards Consortium, similar to the World Wide Web Consortium (W3C), that would ensure interoperability, consistency, accessibility, security, and innovation within the network. The Standards Consortium would define and enforce technical standards for the metaverse, ensuring that developers follow the same rules and guidelines when creating virtual environments. This approach would enable users to easily move between different areas of the metaverse without encountering technical barriers or limitations. It would also ensure that the virtual environment is inclusive and accessible to users with disabilities, while providing security and privacy for all users. By taking this approach, we can create a seamless and engaging virtual space that can be enjoyed by all users, and usher in a new era of immersive digital experiences.\r\n\r\n**A NOTE:**  If you think this is ChatGPT mambo Jambo you would be right. But I think based on the discussions we already had in past meetings I see this as a starting point for some sort of a wiki page all we can edit and contribute. Each of this concepts can and should be expanded with technical implementations (some of which have already started). Feel free to delete this is the FiG thinks its just noise.\r\n\r\n### What is the motivation for this suggestion?\r\n**Why is this important?** \r\n\r\n**What are the use cases for this suggestion?**\r\nJane is a tech-savvy individual who loves to explore new digital experiences. She has recently purchased a VR helmet and is eager to try out the metaverse world for the first time. Jane opens up her browser app on her VR helmet and enters the human-readable name of the metaverse world she wants to access. The Name Resolution system resolves the name to the appropriate IP address, and the Routing system directs her traffic to the server hosting the virtual space.\r\n\r\nOnce inside the virtual space, Jane explores the environment using her VR helmet, taking in the immersive sights and sounds of the virtual world. She interacts with other users and explores different areas of the virtual space, having a great time.\r\n\r\nAfter spending some time in the virtual space, Jane needs to leave her VR helmet and continue her experience on her mobile phone. She opens up her browser app on her phone and logs into the metaverse network using her account credentials. The metaverse network recognizes her account and the virtual space she was previously exploring, and she is able to seamlessly continue her experience on her mobile phone.\r\n\r\nWhile the VR experience provides a fully immersive and interactive experience, the mobile phone experience is more limited, with a smaller screen and less advanced graphics. However, both experiences are provided by the same virtual metaverse world, ensuring consistency and continuity between the two experiences.\r\n\r\nJane is impressed with the seamless and accessible experience provided by the metaverse, and is excited to continue exploring different areas of the virtual world using both her VR helmet and her mobile phone.\r\n\r\nThe use case of Jane, as she explores the virtual metaverse world using her VR helmet, her group of friends who are also in the virtual space can see a fully immersive virtual avatar of Jane, which moves and interacts with the virtual environment in real-time. Her friends can see her movements and gestures, hear her voice, and engage with her as if she were physically present in the same virtual space.\r\n\r\nWhen Jane switches to her mobile phone to continue her experience, her friends can still see her virtual avatar moving around in the virtual space, but her interactions are limited to text-based chat or voice chat. Her avatar movements and gestures are no longer visible to her friends, as they are not using a VR device, but she can still engage with them through text or voice chat.\r\n\r\nDespite the difference in the level of immersion and interaction, Jane's friends can still see and interact with her virtual avatar regardless of the device she is using. This ensures consistency and continuity of the virtual experience, regardless of the device being used by different users.\r\n\r\nThis use case demonstrates how the metaverse protocol allows for seamless cross-device interaction, ensuring that users can engage with each other in the virtual space regardless of the device being used.\r\n\r\n### Suggestion description:\r\nThe purpose of this RFC is to propose a protocol for the creation and deployment of immersive simulations and virtual reality applications that can be accessed from a federated network of servers. The protocol should support accessibility from multiple devices, offer security features, and allow for the development of a descriptive language that can be used to create worlds with structure, styling, and behavioral interaction programming.\r\n\r\n#### Requirements:\r\n\r\n1. Federated Service: The metaverse protocol should be a federated service that allows users to access immersive simulations and VR applications from a network of servers.\r\n2. Browser App: The protocol should support the development of a browser app that can be used to access the metaverse from various devices, including VR helmets, AR glasses, mobile phones, and desktop computers.\r\n3. Descriptive Language: The protocol should support the development of a descriptive language that can be used to create worlds with structure, styling, and behavioral interaction programming.\r\n4. Security: The protocol should include security features to ensure the safety and privacy of users while they are accessing the metaverse.\r\n5. Accessibility: The protocol should support accessibility features to ensure that users with disabilities can access the metaverse.\r\n6. Name Resolution: The protocol should support a name resolution system similar to DNS to allow for easy access to individual worlds hosted on the metaverse network.\r\n7. Routing: The protocol should support a routing system that allows for efficient communication between servers within the metaverse network.\r\n8. Domain Registrars: The protocol should support the development of domain registrars that allow users to register their own worlds within the metaverse network.\r\n9. Standards Consortium: The protocol should support the development of a standards consortium that can create and enforce standards for the development of worlds within the metaverse network.\r\n\r\n#### Implementation:\r\nThe metaverse protocol should be implemented using a combination of existing standards and technologies, including HTTP/HTTPS, WebAssembly (WASM), and CSS. The protocol should be designed to be flexible and adaptable to future developments in immersive technology.\r\n\r\n##### Federated Service.\r\n\r\nA federated service in the context of a metaverse protocol refers to a network of servers that are connected and can communicate with each other. In other words, it is a decentralized system where each server has its own set of rules and policies, but they can all work together to create a shared environment.\r\n\r\nIn the case of the metaverse, this network of servers would host individual worlds or virtual spaces that users can access through a browser app. Each world would be hosted on a separate server, but they would all be connected in a way that allows users to move seamlessly between them.\r\n\r\nThe federated service would also allow for the creation of shared spaces where multiple users can interact with each other in real-time. For example, a virtual concert or conference could be hosted on a shared server, and users from around the world could attend and interact with each other in real-time.\r\n\r\nTo enable communication between servers, the metaverse protocol would need to include a routing system that allows for efficient communication between servers within the network. This routing system would ensure that users can move between worlds without interruption or delay, and that real-time interactions within shared spaces are smooth and seamless.\r\n\r\n##### Browser App.\r\n\r\nIn the context of the metaverse protocol, the browser app refers to the software application that users would use to access the metaverse from their devices, such as VR helmets, AR glasses, mobile phones, or desktop computers. The browser app would be the primary means for users to discover and visit different worlds within the metaverse network.\r\n\r\nThe browser app would need to be designed to work seamlessly with the metaverse protocol, allowing users to navigate between worlds, interact with objects and other users, and access different types of content, such as audio and video streams, text, or 3D models.\r\n\r\nThe browser app would also need to be compatible with different types of devices and operating systems, ensuring that users can access the metaverse from their preferred device. This would require the development of a cross-platform framework that can run on different hardware and software configurations.\r\n\r\nTo ensure a seamless user experience, the browser app would need to be optimized for performance, with fast loading times and minimal latency. This would require the use of modern web technologies, such as WebAssembly or WebGL, to enable high-quality graphics and real-time interactions.\r\n\r\nIn addition to providing access to the metaverse, the browser app could also include features such as social networking, messaging, and content creation tools, allowing users to interact with each other and contribute to the metaverse in meaningful ways.\r\n\r\nSee: #4 \r\n\r\n##### Descriptive Language.\r\n\r\nIn the context of the metaverse protocol, the descriptive language refers to a programming language that can be used to create worlds with structure, styling, and behavioral interaction programming. The language would provide a standardized way for developers to create and describe virtual environments within the metaverse network.\r\n\r\nThe descriptive language would need to be flexible and versatile, allowing developers to create a wide range of environments, from simple 3D spaces to complex interactive experiences. It would also need to be easy to learn and use, enabling a broad community of developers to contribute to the metaverse.\r\n\r\nThe language would include features for creating and manipulating objects within the virtual environment, such as 3D models, textures, lighting, and physics simulations. It would also include tools for creating interactive elements, such as buttons, menus, and triggers, that respond to user input and enable navigation and interaction within the virtual environment.\r\n\r\nTo ensure consistency and interoperability across different worlds within the metaverse network, the descriptive language would need to be standardized and governed by a standards consortium. This consortium would define and enforce the rules and best practices for using the language, ensuring that all worlds within the metaverse are compatible and accessible to users.\r\n\r\nThe descriptive language would also need to be extensible, allowing developers to create custom plugins and libraries that can be shared and reused across different worlds within the metaverse network.\r\n\r\n##### Security.\r\n\r\nIn the context of the metaverse protocol, security refers to the measures taken to ensure the safety and privacy of users while they are accessing the virtual environment. The metaverse is a distributed system, which means that it presents unique security challenges that need to be addressed to protect users and their data.\r\n\r\nOne of the main security challenges in the metaverse is the potential for malicious actors to create and distribute malware or other types of malicious content within the virtual environment. To address this, the metaverse protocol would need to include security features that can detect and prevent the spread of malware and other types of malicious content.\r\n\r\nThe metaverse protocol would also need to include features to protect user data and privacy. This could include encryption and authentication mechanisms to ensure that user data is transmitted securely and only accessible to authorized users. It could also include privacy settings that enable users to control who has access to their data and how it is used within the metaverse.\r\n\r\nAnother important aspect of security in the metaverse is user identity and authentication. The protocol would need to include mechanisms to ensure that users are who they claim to be and that their identity is protected from unauthorized access. This could include biometric authentication or other types of secure authentication mechanisms.\r\n\r\nTo enforce security and privacy standards across the metaverse network, the protocol would need to be governed by a standards consortium that defines and enforces best practices for security and privacy. This consortium would develop and maintain security and privacy standards that all worlds within the metaverse network would need to comply with.\r\n\r\n##### Accessibility.\r\n\r\nIn the context of the metaverse protocol, accessibility refers to the measures taken to ensure that users with disabilities can access and interact with the virtual environment. Accessibility is a critical aspect of the metaverse, as it ensures that the virtual environment is inclusive and accessible to all users.\r\n\r\nThere are many different types of disabilities that can impact a user's ability to access and interact with the virtual environment. For example, users with visual impairments may need alternative ways to navigate and interact with the environment, while users with hearing impairments may need alternative ways to access audio content.\r\n\r\nTo address these challenges, the metaverse protocol would need to include accessibility features that enable users with disabilities to access and interact with the virtual environment. This could include features such as text-to-speech and speech-to-text conversion, customizable color schemes and font sizes, and support for alternative input devices such as Braille displays or eye-tracking technology.\r\n\r\nThe protocol would also need to comply with existing accessibility standards, such as the Web Content Accessibility Guidelines (WCAG), to ensure that the virtual environment is accessible to the widest possible range of users.\r\n\r\n##### Name Resolution.\r\n\r\nIn the context of the metaverse protocol, Name Resolution refers to the process of translating human-readable names into IP addresses or other identifiers that can be used to locate individual worlds or virtual spaces within the metaverse network. It is similar to the Domain Name System (DNS) used for resolving website names on the World Wide Web.\r\n\r\nName Resolution is a critical component of the metaverse protocol, as it enables users to easily locate and access individual worlds or virtual spaces within the network. Without Name Resolution, users would need to know the IP address or other identifier for each individual world they want to access, which would be difficult and cumbersome.\r\n\r\nTo enable Name Resolution within the metaverse network, the protocol would need to include a system for registering and resolving human-readable names. This system would be similar to the domain name registration system used for registering website names on the World Wide Web.\r\n\r\nThe system would include a set of registrars that are authorized to register human-readable names within the metaverse network. Users would be able to register their own names, similar to registering a domain name, and associate them with individual worlds or virtual spaces hosted on the network. When a user enters a human-readable name into the browser app, the system would resolve the name to the appropriate IP address or other identifier for the corresponding world or virtual space.\r\n\r\nThe Name Resolution system would need to be designed to ensure security and privacy, as well as scalability and efficiency. It would need to be able to handle a large number of registrations and resolutions, and provide fast and reliable service to users.\r\n\r\n##### Routing.\r\n\r\nIn the context of the metaverse protocol, Routing refers to the process of directing network traffic between servers within the metaverse network. It is an essential component of the protocol, as it enables users to move seamlessly between individual worlds or virtual spaces within the network.\r\n\r\nTo enable Routing within the metaverse network, the protocol would need to include a system for directing traffic between servers. This system would be similar to the routing system used for directing traffic on the World Wide Web.\r\n\r\nThe system would include a set of routing servers that are responsible for directing traffic between servers within the network. When a user moves between worlds or virtual spaces within the network, the routing servers would direct their traffic to the appropriate server hosting the corresponding world or virtual space.\r\n\r\nThe Routing system would need to be designed to ensure security and privacy, as well as scalability and efficiency. It would need to be able to handle a large amount of traffic, and provide fast and reliable service to users.\r\n\r\nAn example of a Name Resolution procedure step-by-step from URL up to the server streaming the assets to the client:\r\n\r\n1. The user enters a human-readable name for the world or virtual space they want to access into the browser app.\r\n2. The browser app sends a request to the Name Resolution system to resolve the name into an IP address or other identifier for the corresponding world or virtual space.\r\n3. The Name Resolution system checks its database to see if the name is registered and associated with an IP address or other identifier.\r\n4. If the name is registered, the Name Resolution system returns the IP address or other identifier to the browser app.\r\n5. The browser app sends a request to the Routing system to direct their traffic to the server hosting the corresponding world or virtual space.\r\n6. The Routing system checks its database to see which server is hosting the requested world or virtual space.\r\n7. The Routing system directs the user's traffic to the appropriate server hosting the corresponding world or virtual space.\r\n8. The server hosting the world or virtual space receives the user's traffic and begins streaming the assets to the client.\r\n9. The client receives the assets and displays the virtual environment to the user.\r\n\r\n##### Domain Name Registrars.\r\n\r\nIn the context of the metaverse protocol, domain name registrars would play a key role in the Name Resolution process. Domain name registrars are companies that are authorized to register and manage domain names on behalf of users. They would be responsible for registering human-readable names within the metaverse network and associating them with individual worlds or virtual spaces hosted on the network.\r\n\r\nTo become a domain name registrar within the metaverse network, a company would need to meet certain requirements and be authorized by the governing standards consortium. These requirements could include things like security and privacy standards, financial stability, and technical expertise.\r\n\r\nOnce authorized, a domain name registrar would be responsible for managing the registration and renewal of domain names within the metaverse network. They would also be responsible for providing tools and services to users to manage their domain names and associated virtual spaces.\r\n\r\nSome of the key services provided by domain name registrars within the metaverse network could include:\r\n\r\n1. Domain name registration: The registrar would enable users to register human-readable names within the metaverse network and associate them with their virtual spaces.\r\n2. DNS management: The registrar would manage the Domain Name System (DNS) for the virtual spaces associated with each domain name, ensuring that the correct IP addresses or other identifiers are associated with each virtual space.\r\n3. Security and privacy management: The registrar would provide tools and services to ensure the security and privacy of user data within the metaverse network.\r\n4. Technical support: The registrar would provide technical support to users, helping them to resolve issues related to their domain names or associated virtual spaces.\r\n\r\n##### Standards Consortium.\r\n\r\nIn the context of the metaverse protocol, a Standards Consortium would be responsible for defining and enforcing the standards and best practices for using the protocol. The consortium would be similar to the World Wide Web Consortium (W3C), which is responsible for developing and maintaining the standards for the World Wide Web.\r\n\r\nThe Standards Consortium would be a non-profit organization made up of industry experts, developers, and other stakeholders who are involved in the development and use of the metaverse. The organization would be responsible for defining and maintaining the technical standards for the metaverse, as well as providing guidance and support to developers and users.\r\n\r\nThe structure of the Standards Consortium would be similar to that of the W3C, which is organized around working groups, interest groups, and advisory committees. The working groups are responsible for developing and maintaining the technical standards, while the interest groups and advisory committees provide guidance and support to developers and users.\r\n\r\nThe process of approval for RFCs (Request for Consideration) would follow a similar process to that of the W3C. The process would involve the following steps:\r\n\r\n1. Proposal: A member of the community would propose a new standard or modification to an existing standard.\r\n2. Working Group: The proposal would be reviewed by a working group within the Standards Consortium.\r\n3. Draft Specification: The working group would develop a draft specification for the proposed standard or modification.\r\n4. Public Review: The draft specification would be made available for public review and comment.\r\n5. Approval: The working group would review the public comments and make any necessary changes to the draft specification. Once the specification is finalized, it would be submitted for approval by the Standards Consortium.\r\n6. Implementation: Once the standard is approved, it would be implemented by developers within the metaverse network.\r\n\r\n### Term definition\r\n- Metaverse Protocol: A set of technical standards and guidelines that developers follow when creating virtual environments within the metaverse, ensuring consistency, interoperability, and accessibility within the network.\r\n- Standards Consortium: A governing body that oversees the development and implementation of the metaverse protocol, ensuring that developers adhere to the same rules and guidelines when creating virtual environments within the network.\r\n- Name Resolution System: A system that resolves human-readable names into IP addresses, enabling users to easily access different virtual environments within the metaverse network.\r\n- Routing System: A system that directs user traffic to the appropriate server hosting the virtual environment, enabling users to seamlessly move between different virtual environments within the metaverse network.\r\n- Federated Services: A system where various services and platforms can interoperate with each other to provide a seamless experience to the users, enabling different virtual worlds and virtual spaces to interoperate with each other within the metaverse network.\r\n\r\n### What are the advantages of the suggestion?\r\nTaking the approach of developing a standards-based metaverse protocol with a Standards Consortium has several advantages, including:\r\n\r\n- Interoperability: By defining and enforcing technical standards for the metaverse, the Standards Consortium would enable interoperability between different worlds and virtual spaces within the network. This would ensure that users can easily move between different areas of the metaverse without encountering technical barriers or limitations.\r\n- Consistency: Standards-based development ensures that all developers are following the same rules and guidelines when creating virtual environments within the metaverse network. This would ensure that users have a consistent experience across different virtual environments within the network.\r\n- Accessibility: Standards-based development would enable the metaverse protocol to include accessibility features that ensure that the virtual environment is accessible to users with disabilities. By following the standards set by the consortium, developers can ensure that their virtual environments are inclusive and accessible to all users.\r\n- Security: The Standards Consortium would define and enforce security standards for the metaverse protocol, ensuring that user data is transmitted securely and that the virtual environment is protected from malicious actors.\r\n- Innovation: By creating a standardized, open-source protocol for the metaverse, developers would have access to a broad range of tools and resources, enabling them to innovate and create new and exciting virtual environments within the network.\r\n\r\n### What are the disadvantages of the suggestion?\r\nWhile the approach of creating a metaverse with a standards-based protocol and a Federated Service model has many advantages, there are also some potential disadvantages, including:\r\n\r\n- Complexity: Developing and implementing a standards-based protocol and Federated Service model can be complex and require significant resources, making it difficult for smaller companies or individuals to participate in the development of the metaverse.\r\n- Fragmentation: If the metaverse protocol is too rigid or inflexible, it could lead to fragmentation of the network, with different virtual worlds and virtual spaces using different protocols or standards. This could make it difficult for users to move between different virtual environments within the network.\r\n- Privacy Concerns: The use of a Federated Service model could raise privacy concerns, as it would require the sharing of user data and information across different virtual environments within the metaverse network. This could raise concerns about data ownership and privacy, as well as the potential for data breaches or hacks.\r\n- Governance Issues: The development and implementation of a standards-based protocol and Federated Service model would require effective governance and decision-making structures to ensure that the protocol remains up-to-date and relevant. Without effective governance, the metaverse network could become stagnant or outdated, leading to a decline in user adoption and engagement.\r\n- Technical Challenges: The development and implementation of a standards-based protocol and Federated Service model would require significant technical expertise and resources, making it challenging for smaller companies or individuals to participate in the development of the metaverse. This could lead to a lack of diversity and creativity within the network, limiting the potential for innovation and growth.\r\n\r\n### Are there any alternatives to this suggestion?\r\n- Decentralized Metaverse: Rather than relying on a central protocol and Standards Consortium, a decentralized metaverse could be developed using blockchain technology. This would enable greater control and ownership by individual users and developers, and could eliminate the need for a central governing body.\r\n- AI-driven Metaverse: An AI-driven metaverse could be developed using advanced artificial intelligence algorithms and machine learning techniques. This could enable greater automation and customization of the virtual environment, and could lead to more personalized and engaging user experiences.\r\n- Social Media Integration: Rather than developing a separate metaverse network, social media platforms could integrate virtual environments and experiences directly into their existing platforms. This would enable users to seamlessly move between different virtual environments and social media platforms, and could lead to wider adoption and use of virtual experiences.\r\n\r\n### What is the strategy for adoption?\r\n#### Stage 1: Development and Testing\r\nThe first stage would be the development and testing of the metaverse protocol by a core group of developers and stakeholders. This stage would involve the development and testing of the protocol, as well as the creation of a Standards Consortium to oversee the development and implementation of the protocol.\r\n\r\n#### Stage 2: Early Adopters\r\nThe second stage would involve the recruitment of early adopters, including developers and companies interested in building virtual environments within the metaverse network. These early adopters would be given access to the protocol and provided with support and resources to help them develop virtual environments within the network.\r\n\r\n#### Stage 3: User Testing\r\nThe third stage would involve user testing of the virtual environments built within the metaverse network. This would involve recruiting users to test the virtual environments and provide feedback on the user experience, as well as identifying and addressing any technical issues or bugs in the protocol.\r\n\r\n#### Stage 4: Expansion\r\nThe fourth stage would involve the expansion of the metaverse network to a broader user base, including individuals, businesses, and organizations. This would involve marketing and outreach efforts to raise awareness of the metaverse network and its potential benefits, as well as providing resources and support to help users and developers get started with the platform.\r\n\r\n#### Stage 5: Integration\r\nThe final stage would involve the integration of the metaverse protocol into existing platforms and services, such as social media, gaming, and e-commerce platforms. This would enable users to seamlessly move between different virtual environments and experiences, and further increase the adoption and use of the metaverse network.\r\n\r\n\r\n","author":{"login":"SebaSOFT"},"comments":{"nodes":[{"id":"DC_kwDOI2aYAs4AVCO1","author":{"login":"SebaSOFT"},"body":"Other concepts we can throw in:\r\nServer-side Rendering: Server-side rendering (SSR) involves rendering web pages on the server before sending them to the user's browser. This approach can improve page load times, reduce the amount of data sent to the user's device, and improve the overall user experience.\r\nIn the context of the metaverse, SSR could be used to render virtual environments on the server side, reducing the processing load on the user's device and enabling faster load times for virtual environments.\r\n\r\nEdge Rendering: Edge rendering involves rendering content closer to the user, typically on a content delivery network (CDN) server located closer to the user's physical location. This approach can reduce latency and improve the overall user experience.\r\nIn the context of the metaverse, edge rendering could be used to render virtual environments closer to the user, reducing latency and improving the overall performance of the virtual environment.\r\n\r\nContent Distribution Network (CDN): A CDN is a network of servers distributed around the world that are used to deliver content to users. CDNs can improve page load times, reduce latency, and improve the overall user experience.\r\nIn the context of the metaverse, CDNs could be used to distribute virtual environments and content to users around the world, reducing latency and improving the overall performance of the virtual environment."},{"id":"DC_kwDOI2aYAs4AVCUw","author":{"login":"SebaSOFT"},"body":"Closing this discussion as this was expanded by ChatGPT and though it was reviewed, a lack of content generation in the Fig and the group is also a signal of adoption/willfulness and needs to be well respected."}]},"labels":{"nodes":[]}},{"id":"D_kwDOI2aYAs4AS2nD","category":{"name":"Meetings"},"upvoteCount":2,"updatedAt":"2023-03-08T17:55:34Z","createdAt":"2023-03-08T17:55:33Z","number":8,"title":"Virtual Worlds and Simulations meeting agenda for 2023-03-08","body":"- **Date/Time**: March 8th, 2023 @ Wednesday 12:00 PM ET / 17:00 UTC / 6:00 PM CET\r\n\r\nTo keep up momentum, as I've still been sick during this week, we've had an informal meeting talk on various topics. A few rough notes to keep people up-to-date:\r\n- New OpenMV standards should be \"at least as good or better\" than what the web currently offers, or there's no point to have a new standard. (see: DNS)","author":{"login":"LaylBongers"},"comments":{"nodes":[]},"labels":{"nodes":[]}},{"id":"D_kwDOI2aYAs4ASjf9","category":{"name":"Meetings"},"upvoteCount":1,"updatedAt":"2023-02-22T18:47:13Z","createdAt":"2023-02-16T03:16:35Z","number":6,"title":"Proposed Virtual Worlds and Simulations meeting agenda for 2023-02-22","body":"## Meeting Details\r\n\r\n- **Date/Time:** February 22th, 2023 @ Wednesday 12:00 PM ET / 17:00 UTC / 6:00 PM CET\r\n- **Location:** Link should be posted in the `#Virtual-world-sim` text and voice channel on Discord at least 5 days before the meeting.\r\n- **Moderator:** @LaylBongers \r\n- **Note Taker** \r\n\r\nThe [FIG Virtual Worlds and Simulations Meetings](https://github.com/Open-MV/fig-virtualworldsim/tree/main/meetings) repo contains the history past meetings, including a link to the agenda, recording, notes, and resources.\r\n\r\n## Meeting Agenda\r\n\r\n- Add tracking issues for database items that we consider at this point to be obvious high priorities to be handled soon, and expand on the two already added.\r\nFollowup on:\r\n- Priority item on \"metaverse viewer project\" (Tracking issue https://github.com/Open-MV/fig-virtualworldsim/issues/4), we need to start looking at this and exploring what existing projects we can make use of too to reduce our workload in this prototyping stage.\r\n- Break down the \"Avatar-as-Metaobject\" task into its dependencies, and derived features, so we can fit it under a larger \"User Avatars\" epic.\r\n- Database Feature triage\r\n\r\n## Outcomes from Discussion topics\r\n\r\n## Action Items\r\n\r\n**Create actionable items from proposed topics**\r\n\r\n## Items for next week's meeting\r\n**List items that need to be discussed next week**\r\n\r\n## Open Discussion Items\r\n\r\nList any additional items below!\r\n","author":{"login":"OBWANDO"},"comments":{"nodes":[{"id":"DC_kwDOI2aYAs4ATXVM","author":{"login":"LaylBongers"},"body":"Some quick additional discussion topics, if there's time:\r\n- Daicon has been split out from the dacti project, and is now open for feedback and contributions. Is this the right time to move it out of the sandbox group?\r\n- Recommended in-world fonts for early prototypes. Readability in fonts at different angles and small sizes will quickly become an issue if prototypes get traction. (consider humanist options like \"Open sans\" and \"Merriweather Sans\", or even \"Atkinson Hyperlegible\") Additionally, a chosen option should have a broad character set support for languages."},{"id":"DC_kwDOI2aYAs4ATYWg","author":{"login":"LaylBongers"},"body":"## Outcomes from Discussion topics\r\n- specific font doesn't matter too much partially because there's big disagreement, but we could suggest at least using a humanist font like Open Sans\r\n\r\n## Action Items\r\n- take a look at daicon if there's time and interest\r\n- clarify use cases of daicon, potentially with user stories\r\n- reach out to projects and see what we can do for them"}]},"labels":{"nodes":[]}},{"id":"D_kwDOI2aYAs4ASfZC","category":{"name":"Meetings"},"upvoteCount":1,"updatedAt":"2023-02-16T03:17:43Z","createdAt":"2023-02-11T06:04:24Z","number":3,"title":"Virtual Worlds and Simulations meeting agenda for 2023-02-15","body":"## Meeting Details\r\n\r\n- **Date/Time:** February 15th, 2023 @ Wednesday 12:00 PM ET / 17:00 UTC / 6:00 PM CET\r\n- **Location:** Link should be posted in the `#Virtual-world-sim` text and voice channel on Discord at least 5 days before the meeting.\r\n- **Moderator:** @LaylBongers \r\n- **Note Taker** @LaylBongers \r\n\r\nThe [FIG Virtual Worlds and Simulations Meetings](https://github.com/Open-MV/fig-virtualworldsim/tree/main/meetings) repo contains the history past meetings, including a link to the agenda, recording, notes, and resources.\r\n\r\n## Meeting Agenda\r\nDatabase Feature triage\r\n\r\n**Discuss agenda from proposed topics**\r\n\r\n## Outcomes from Discussion topics\r\n\r\n- Industrial users have an interest in saving money using large scale integration tests of their plants, to prototype programs and overall production flow before making large investments or pushing out updates\r\n- Maybe early prototypes don't need to be broadly compatible if they exist primarily for testing the development of formats\r\n\r\n## Action Items\r\n\r\n- Priority item on \"metaverse viewer project\" (Tracking issue #4), we need to start looking at this and exploring what existing projects we can make use of too to reduce our workload in this prototyping stage.\r\n- Break down the \"Avatar-as-Metaobject\" task into its dependencies, and derived features, so we can fit it under a larger \"User Avatars\" epic.\r\n- Add tracking issues for database items that we consider at this point to be obvious high priorities to be handled soon, and expand on the two already added.\r\n\r\n**Create actionable items from proposed topics**\r\n\r\n## Items for next week's meeting\r\n**List items that need to be discussed next week**\r\n\r\n## Open Discussion Items\r\n\r\nList any additional items below!\r\n","author":{"login":"OBWANDO"},"comments":{"nodes":[{"id":"DC_kwDOI2aYAs4ATA9q","author":{"login":"LaylBongers"},"body":"Proposed agenda topics:\r\n- triaging database entries, we've got a lot already covering stuff we may want to do\r\n- discussion on metaverse scripting, including platform limitations on consoles and phones\r\n- update on daicon and dacti formats work, if there's feedback or notes\r\n- actionable plan for a roadmap to replicated user avatars prototype\r\n\r\nSome of last week topics carried over with notes:\r\n- \"file-as-object, \"self-descriptive object\"\r\n- revisiting protocol middleware, any new feedback and research?\r\n- interfacing with third party virtual worlds (suggested TeleportVR client object)"},{"id":"DC_kwDOI2aYAs4ATBZ9","author":{"login":"LaylBongers"},"body":"## Outcomes from Discussion topics\r\n\r\n- Industrial users have an interest in saving money using large scale integration tests of their plants, to prototype programs and overall production flow before making large investments or pushing out updates\r\n- Maybe early prototypes don't need to be broadly compatible if they exist primarily for testing the development of formats\r\n\r\n## Action Items\r\n\r\n- Priority item on \"metaverse viewer project\" (Tracking issue #4), we need to start looking at this and exploring what existing projects we can make use of too to reduce our workload in this prototyping stage.\r\n- Break down the \"Avatar-as-Metaobject\" task into its dependencies, and derived features, so we can fit it under a larger \"User Avatars\" epic.\r\n- Add tracking issues for database items that we consider at this point to be obvious high priorities to be handled soon, and expand on the two already added."}]},"labels":{"nodes":[]}}]}}}}